[{"name": "Compact Academic CV", "cat": "Curricula Vitae/Résumés", "desc": "This curriculum vitae/resume template is designed to succinctly display your career information and works particularly well for showcasing academic careers. Academics tend to have many appointments, honours and publications which this template compresses down to single lines to maximise readability and minimise length. The design is minimalist with plenty of whitespace and a central feature of the template is the optional year labels for all entries in the CV. Entries can be easily modified to house multiple lines or further delimited in sub-sections as shown in the publications section.", "url": "mynbi"}, {"name": "kaobook", "cat": "Books", "desc": "This template is designed for writing books and graduate-level theses and provides numerous examples and documentation to enable complex requirements. The design features a relatively narrow main text column with an adjacent wide margin to house notes, figures, tables, citations and captions. The template body includes numerous examples of how to make use of the large margin for all kinds of content. The main text column contains examples of coloured boxes, lists, code listings, figures, tables, equations, referencing, theorems and more to serve as a reference to cover every possible use case for your own content. The text of the template expertly describes the logic behind the template and then moves on to an overview of the template structure and how it is split into directories and files.", "url": "qpmzj"}, {"name": "fphw Assignment", "cat": "Assignments", "desc": "This template is for formatting assignments or homework in a clear and simple way. The title section at the top of the first page clearly displays the assignment, student and class information. This information also appears in the headers and footers of subsequent pages. Questions in the assignment are clearly demarcated and appear inside boxes to focus attention. The template features examples of including images, tables, equations and code listings for covering virtually all common assignment information. Multi-part questions and answers are shown for more complex questions.", "url": "plsgq"}, {"name": "Developer CV", "cat": "Curricula Vitae/Résumés", "desc": "This curriculum vitae/resume template is tailored for software developers to display their skills and experience in a clean and simple way. The top of the template contains space for profiles and contact information on various platforms and uses familiar FontAwesome icons. Skills in various technologies and platforms are displayed at a glance in a skill bar chart and bubbles of varying sizes. Experience at different firms is listed in an ordered list and includes examples of technologies used at each position. Finally, a free-form set of side-by-side sections let the user add any other information they would like to include.", "url": "ejeyd"}, {"name": "Tufte Essay", "cat": "Essays", "desc": "This template uses the Tufte class to create an elegant layout for writing essays or other long-form texts. This class features a somewhat controversial wide margin on the right side of each page. The template starts with a clear title and summary then shows how a large amount of text (typical in an essay) looks in the layout. Pages 2 and on show numerous examples of common essay elements including: sectioning, referencing, figures and tables, typography options and a bibliography. Read the text and margin notes carefully as these include examples and instructions for how to implement these various elements in your own essay.", "url": "tzirw"}, {"name": "Diaz Essay", "cat": "Essays", "desc": "This essay template is best used for literature essays containing mostly text. This is supported by a thin single column layout with clear unnumbered section titles to increase readability. The template contains an abstract, keywords and references, which makes it suitable for college/university essays but these elements can be easily removed for a simpler high school essay. Further examples of common essay components are included: referencing using a bibliography, an inline figure, a table and lists.", "url": "ztejd"}, {"name": "Wenneker Assignment", "cat": "Assignments", "desc": "This template can be used by teachers or students for school or university assignments. It contains a clear title section at the start to specify the assignment class, title, date and teacher/student name. The template supports up to 4 levels of sections to structure the assignment into sections, questions, subquestions and bonus content. Examples of common assignment content are included: figure, equations, lists, table, code and paragraphs of text.", "url": "xcvkp"}, {"name": "The Legrand Orange Book", "cat": "Books", "desc": "This book template features an elegant layout with a beautiful title page and part/chapter headings. The book itself is highly structured into parts, chapters, sections and then subsections. Each is numbered and these numbers are prominently displayed in the left margin where each begins as well as in page headers. Sections and subsections also appear as mini tables of contents on pages separating parts of the book to provide an outline of the content to come.", "url": "rdlnk"}, {"name": "Conference/Event Timetable", "cat": "Calendars", "desc": "This calendar template is useful for creating a conference/event calendar. Each day can be given a title (such as your location on that day) followed by the plan for that day. The calendar can span any number of weeks and the starting dates can be changed.", "url": "tugrp"}, {"name": "Monthly Calendar", "cat": "Calendars", "desc": "This calendar template is useful for creating a calendar month on a single A4 sheet of paper. This can be left blank with just the day numbers or text can be written for individual days. The starting day and date can be readily changed within the template.", "url": "oqibz"}, {"name": "Weekly Timetable", "cat": "Calendars", "desc": "This calendar template is useful for creating a weekly calendar of recurring events. Within each day, the time of the event is divided from the event title for easy scheduling. This layout would suit a university student planning their weekly lectures, as shown in the example.", "url": "racxm"}, {"name": "Professional Table", "cat": "Miscellaneous", "desc": "This table template provides a quick reference for how to add professional-looking tables to any document. The booktabs package is utilized to enable the use of horizontal rules specific for different parts of the table, adding to the overall professional aesthetic of the table. The table includes examples of amalgamating multiple columns into one cell and creating horizontal rules which do not span the entire width of the table. The entire table is extensively commented with further customization options and explanations for each line.", "url": "wzvua"}, {"name": "Focus Presentation", "cat": "Presentations", "desc": "This template creates modern presentation slides using the beamer class. The minimalist design lets you quickly enter your content and spend time honing your message rather than wasting time in presentation software. The template includes examples of many slide types which should cover most use cases as well as different ways of putting in your content no matter what it is and how you want to emphasize it.", "url": "kwcgs"}, {"name": "Lachaise Assignment", "cat": "Assignments", "desc": "This template is for teachers/instructors/educators to create assignments/homework for their students. It includes a clear title on the first page for the course, assignment and teacher's name, as well as the institution and date. Sets of questions can be grouped by headings and the template includes examples of unnumbered and numbered sections, and numbered subsections (for longer assignments). Amongst the description text for each question, examples are provided for virtually any subject matter, including: equations, algorithms, code and command line outputs.", "url": "hhzez"}, {"name": "Cleese Assignment", "cat": "Assignments", "desc": "This template comes in two versions, one for teachers/instructors/educators to create assignments/homework for their students to fill out by hand, and another for students proficient in LaTeX to answer questions posed to them at school or university/college. Both versions contain simple environments for each question and subquestion within, and allow answer boxes to be created with either an answer or blank for space to write an answer. Sets of questions can be grouped by headings and the template includes examples of including an image, table, equation and code within questions.", "url": "rocck"}, {"name": "Freeman Curriculum Vitae", "cat": "Curricula Vitae/Résumés", "desc": "This curriculum vitae template fits a large amount of information in a concise two-column layout without feeling too saturated with information. Sections are cleanly delimited and can be easily moved around to highlight the parts of your experience and skills that are most important to the job you are applying for. The template includes a number of example section types which should enable you to find a place for any type of information you'd like to include.", "url": "jwdrk"}, {"name": "Dictionary", "cat": "Miscellaneous", "desc": "This template creates a dictionary with a two-column layout and clear headings delimiting different letters. The header on each page contains the first and last word on that page, making for easy navigation. Converting your current dictionary information to use in this template is easy as a single command specifies the addition of each word. By default, this line has four arguments for the: word, pronunciation, classification and definition. Each can be customized as required (e.g. bold, italic, sans-serif, etc) or other arguments can be added.", "url": "rgztr"}, {"name": "Formal Book Title Page", "cat": "Title Pages", "desc": "This title page template is best suited to books and formal applications, such as in the fields of science or engineering. It features a formal layout with a clear title highlighted by two horizontal rules. A subtitle is available to further describe the work and multiple authors/editors are catered for towards the centre of the page.", "url": "sjoct"}, {"name": "Stylish Title Page", "cat": "Title Pages", "desc": "This title page template features a large title and subtitle surrounded by two curly brackets to bring focus to the title and add to the stylish design of the template. The author name is centered below the title and publisher information is seen at the bottom. This makes the template best suited to a book or other large work, but it can be easily adapted to any other usage.", "url": "zmksh"}, {"name": "Classic Lined Title Page", "cat": "Title Pages", "desc": "This title page template features a classic lined look most suited to a book or other larger work. The title is highlighted with large red all-caps text and a thin rule underneath separates it from the author name and publisher further down the page.", "url": "jfgfb"}, {"name": "Vertical Line Title Page", "cat": "Title Pages", "desc": "This title page template features a central vertical line which frames the rest of the text on the page. The title is clearly visible in a large bold font and the design also includes a subtitle, author name and publisher information. The title page would be well suited to a book but it can be used for other applications too.", "url": "tvipc"}, {"name": "Minimalist Book Title Page", "cat": "Title Pages", "desc": "This title page template is best suited for a book. The minimalistic design immediately highlights the title and the use of red further focuses the eye on the core of what the work is about. The subtitle is neatly tucked away under the title to expand on it and the author/publisher information frames the title.", "url": "cvyee"}, {"name": "Multi-Purpose Large Font", "cat": "Title Pages", "desc": "This title page template can be used for almost any document type. The title is displayed in a very large font size in a wide grey box to accentuate the subject matter while your details are shown at the bottom in a small section. The box colour can be changed from grey and the template includes a secondary serif font option.", "url": "bcwrv"}, {"name": "Academic Title Page", "cat": "Title Pages", "desc": "This title page is useful for academic works such as assignments, reports, theses or books. The headings can be used to neatly display the institute, course or subject matter of the work. It design is clean with the major feature being two horizontal lines highlighting the title. The template contains code for an alternate layout without a supervisor name and for an institution logo at the bottom of the page.", "url": "mwqiq"}, {"name": "Awesome Resume/CV and Cover Letter", "cat": "Curricula Vitae/Résumés", "desc": "This gorgeous Resume/CV template comes with a matching cover letter template to help simplify the process of applying for your next job. Both templates feature a clean header listing your essential contact information and fields of expertise as well as a subtle matching footer. Clear sectioning within the resume/CV template ensures your achievements are easily navigated and extensively described by major heading, then minor heading, then sub-heading. The location and dates of each achievement or event are clearly highlighted. The cover letter template is also sectioned by major heading but these headings are not mandatory if only simple paragraphs are required.", "url": "zhgvs"}, {"name": "Wenneker Article", "cat": "Articles", "desc": "This article template features a large eye-catching title section with space for multiple authors and affiliations per author. The article has a traditional two column layout to make content easy to read. An abstract section is present to provide a lead-in or summary of the article and features a large lettrine to further draw the reader's eye. The template contains examples of sectioning, referencing, equations, tables, figures and lists to make it easy for you to get started.", "url": "nsiop"}, {"name": "Professional Formal Letter", "cat": "Formal Letters", "desc": "This formal letter template is suitable for individuals representing a professional institution such as a university, company or organization. This is most evident in the large header at the top of the letter where there is space for a logo and a large institution name along with your name and title. A block for your information is neatly tucked away underneath the header line on the right with a vertically-overlapping block for the addressee information underneath on the left. Finally, the content of the letter is laid out in neat justified paragraphs with the signature on the bottom aligning with the date at the top of the letter.", "url": "vuwzl"}, {"name": "Thin Formal Letter", "cat": "Formal Letters", "desc": "This formal letter template has a narrow appearance befitting this type of letter. The layout is very conservative so as to give an air of formality and ample space is left on the bottom of the letter for a signature. Address fields are provided for both the sender and recipient of the letter.", "url": "cktdp"}, {"name": "Twenty Seconds Resume/CV", "cat": "Curricula Vitae/Résumés", "desc": "This simple Resume/CV template features a large sidebar with key information about you neatly presented for quick perusal. Your main skills can be quickly highlighted using progress bars ranging from novice to expert, this is particularly useful for programming languages and other skills where time is required for mastery. The template body is then presented delimited by large colored section titles (alternating gray and blue). Inside these, you can further divide content by subsection or simply write paragraphs. Lists of achievements or timelines can be constructed using one of two environments: long lists with descriptions or short one-line lists.", "url": "sukgh"}, {"name": "Masters/Doctoral Thesis", "cat": "Theses", "desc": "This template provides a full framework for writing a graduate level thesis. It is carefully structured and separated into multiple parts for easy editing. Included are the following pages/sections: a cover page, declaration of authorship, quotation, abstract, acknowledgements, contents pages, list of figures, list of tables, abbreviations, physical constants, symbols, dedication, example chapter, example appendix and bibliography.", "url": "axidw"}, {"name": "Letter of Notice", "cat": "Formal Letters", "desc": "This formal letter template is specifically tailored to provide a short notice to the addressee. The large heading bar at the top provides a central focus for the letter while the body of the letter is intentionally narrow, centered and in an 11pt font size with increased spacing to restrict the text of the letter to a single sharp message. This template would be most suited to a short formal communication of notice between a client and a business, such as for a notice of inspection, resignation letter or a letter stating intent to move out of a property.", "url": "hlzfk"}, {"name": "Elmueller Formal Letter", "cat": "Formal Letters", "desc": "This formal letter template uses the 'scrlttr2' class to structure the letter for mailing with a special section for the addressee designed for windowed envelopes. The letter content is wide and fills the entire page with ample spacing between paragraphs for easy reading.", "url": "nbdze"}, {"name": "Wenneker Resume/CV", "cat": "Curricula Vitae/Résumés", "desc": "This simple and clean Resume/CV template features a two column layout with your most important information displayed in the left column for immediate overview by potential employers. This template would suit an early-mid career graduate looking for a clean, simple and elegant CV with minimal fuss.", "url": "whbsu"}, {"name": "Cheatsheet", "cat": "Miscellaneous", "desc": "This template is for creating a single page cheatsheet. Cheatsheets act as a reference for shortcuts in an application but can also be used as a reference for commands, symbols, functions, equations and any other use case where there are many ways to do something. The template features a three column layout to pack in a large amount of information into the single page. Each column is further subdivided by headings and blocks of similar commands are separated by spaces. ", "url": "rtvca"}, {"name": "Canadian Forces Memo", "cat": "Miscellaneous", "desc": "This template is for producing a memorandum memo within the Canadian Forces. It was made by using the Military Writing Guide provided for K. Thomas by his MCpl. Following many terrible experiences of having a memo come back with formatting adjustments required, he decided to come up with a template that will for the most part print a correctly-formatted memo with little need to make tweaks by the user.", "url": "dugts"}, {"name": "Poems", "cat": "Miscellaneous", "desc": "This template typesets your poetry in a beautiful and simple way using the 'verse' LaTeX package and a number of custom commands. The template is designed for you to quickly typeset poetry without worrying about complex indentation and positioning. The template is highly structured and commented for you to immediately see how each of the elements is to be used.", "url": "dmcld"}, {"name": "Article Notes", "cat": "Miscellaneous", "desc": "This template is for academics and students wishing to make notes on academic articles for future reference or distribution. It is ideal for long-term preservation of thoughts on any given publication and lets you easily specify the information of the article as well as when the notes were made and last revised. Sections within the template can be populated with your notes on the theoretical background, methods, results and discussion/conclusions of the article. A citation is included which lets you easily search a folder full of notes to find the relevant publication. The template is arranged in two columns and landscape orientation by default but these can be easily changed.", "url": "btagf"}, {"name": "Custom Class", "cat": "Miscellaneous", "desc": "This template is for advanced users of LaTeX who are interested in creating their own LaTeX class. The creation of a LaTeX class allows one to specify all document requirements (packages, input files, etc) and layout specifications in a .cls file while reserving the .tex file purely for content. An important feature of this template is the inclusion of a pair of custom class options which act as a toggle within the class to change document settings based on the class option supplied. This means the user of the .tex file can change the class option at the top of the template .tex file which changes the layout of the document.", "url": "zbvar"}, {"name": "Wilson Resume/CV", "cat": "Curricula Vitae/Résumés", "desc": "This Resume/CV template features a spacious layout with a conservative style designed to clearly and simply put forward your work experience and information. The layout is most suited to longer CVs as job descriptions can be quite extensive and can be organized with bullet points or paragraphs of text. The inclusion of a personal profile allows you to succinctly state your career goals and achievements while the skills section lets you list large amounts of technical expertise. Your contact information and your referees' contact information is displayed in customizable blocks allowing you to expand them as needed.", "url": "ntdic"}, {"name": "eBook", "cat": "Books", "desc": "This ebook template is for those wishing to create a book in a format that is easily readable on electronic screens. To facilitate this, the template features a layout with narrow margins and a large font size to use as much of your screen real estate as possible. Each page features a header with the author and title of the book, as well as a page count at the bottom to indicate progress. Book content can be divided by parts, chapters, sections, subsections and subsubsections. The spacious table of contents lets you rapidly select a chapter or part and takes you to it with a click. The large background image in the title page makes your book easily identifiable when browsing a large number of PDFs in a folder.", "url": "hcujl"}, {"name": "Contract", "cat": "Miscellaneous", "desc": "This template is for creating a contract with static and dynamic content. It is designed such that you add your static contract terms to the template once and re-use it for many clients using a number of dynamic variables, such as for the payee's name and the hourly rate. The template contains a spacious layout with a minimalist title page and tailing page containing signature lines for all parties.", "url": "nfbqo"}, {"name": "Association for Computing Machinery ACM", "cat": "Academic Journals", "desc": "The Association for Computing Machinery ACM allows authors to submit their manuscripts formatted in LaTeX to any of their journals. For this, they provide templates which contain the structure and referencing style they would like for submissions.", "url": "btdwm"}, {"name": "Science Journal", "cat": "Academic Journals", "desc": "The Science Journal allows authors to submit their manuscripts formatted in LaTeX. For this, they provide a template which contains the structure and reference style they would like for submissions. The template provided here includes a filled-out example article, the Science bibliography style, example bibliography and the scicite package used for formatting the reference numbers. The template is extensively commented and sectioned to make writing your Science manuscript easy.", "url": "gilxp"}, {"name": "Deedy Resume/CV", "cat": "Curricula Vitae/Résumés", "desc": "This Resume/CV template features a large header with your name and contact information clearly displayed. The Resume/CV content is then in a two-column layout which concentrates a large amount of information in a small space. This allows you to choose which aspects of your academic and professional life to focus on depending on their importance for the position you are applying for. Major sections and their subsections are strongly deviated to grab the attention of the hiring manager. ", "url": "sfwvg"}, {"name": "Arsclassica Article", "cat": "Articles", "desc": "This article uses the Arsclassica package (a modification of the Classic Thesis package) to specify the document layout and structure. The template features a single column layout which makes it suitable for a greater number of applications such as for academic articles, business articles and reports. The page layout is very clean and minimal to focus on the content at hand in an elegant way.", "url": "ybzvf"}, {"name": "Professional Newsletter", "cat": "Newsletters", "desc": "This elegant newsletter template is best suited to corporate or organizational newsletters with several large entries. It features space for a large wide header at the top with the company logo and information. The layout is highly modifiable and features the ability to include a sidebar encased in a border, an in-text box, quotation and single or multi-column text layouts in any configuration! The template makes extensive use of linking for quick reader browsing, a table of contents is present on the first page and links to every entry in the newsletter.", "url": "fkqid"}, {"name": "Cies Resume/CV", "cat": "Curricula Vitae/Résumés", "desc": "This Resume/CV template features a compact information-rich layout suitable for a mid-career professional. A defining feature of the design is a relatively large block of two-column text at the start of the template to include a summary of interests, achievements, history, etc. This acts as a useful place to communicate information with the potential employer that may otherwise be overlooked by simply reading a list of achievements and job titles. The content is arranged primarily by employer with the ability to list multiple positions within the same company.", "url": "tovfa"}, {"name": "Institute of Electrical and Electronics Engineers IEEE", "cat": "Academic Journals", "desc": "The Institute of Electrical and Electronics Engineers IEEE allows authors to submit their publications formatted in LaTeX to any of their 100+ transactions journals. For this, they provide the IEEEtran class and demo templates which contain the structure and reference style they would like for submissions. The IEEE Photonics Society also provides the IEEEphot class and a demo template for submissions to IEEE Photonics.", "url": "pvnsq"}, {"name": "Memo", "cat": "Miscellaneous", "desc": "This template uses the texMemo class to make writing a memo using LaTeX incredibly simple. The template includes the ability to include a company logo underneath which the memo information is housed. The layout of the document is professional and the use of the Palatino font gives it a unique touch to differentiate your memos from those produced by other means!", "url": "julmv"}, {"name": "Maggi Memoir Thesis", "cat": "Theses", "desc": "This template uses the memoir document class to beautifully typeset a thesis. It is suitable for any high-level degree thesis such as for a PhD, Masters or Honors. The layout of the content is in a thin format to promote easy reading and the template features advanced specification of margins and trimming. The thesis boasts a professional look which is immediately obvious from the title page itself and carries through the design of the rest of the document. Three custom fonts are used in the template to match the design and beautifully display your content.", "url": "ierwa"}, {"name": "The Wiley Book Style", "cat": "Books", "desc": "The Wiley Publishing Company provides two templates for authors wishing to use LaTeX to supply their books for typesetting. The difference between the two templates is purely in their dimensions, one is for 6\" x 9\" books while the other is for 7\" x 10\" books. The templates include all features required for book publication: title page, copyright page, dedication, contributors list, table of contents/figures/tables, acronyms, glossary, symbols, parts, chapters, appendices, references and an index.", "url": "oxckx"}, {"name": "NIH Grant Proposal", "cat": "Miscellaneous", "desc": "The National Institutes of Health NIH provides grants to researchers wishing to fund their research projects. The lengthy application requires a great deal of information regarding the proposed research and this template is meant to make the process easier by creating the document structure required for the application and providing examples of typical content. The template is primarily meant for the Specific Aims, Research Plan and Bibliography sections of the grant application but other parts (e.g., Budget Justification) can be created as additions to this template or subsequently created in a word processor.", "url": "brieh"}, {"name": "Short Three Column Newsletter", "cat": "Newsletters", "desc": "This newsletter template is best suited to shorter newsletters consisting of short articles from a number of contributors. It features a prominent main news item at the start to provide a space for important updates or a summation of events by a single author. The body of the newsletter has a three-column layout which is conducive to short articles by a number of authors. The newsletter header on the first page clearly displays the newsletter name and edition while the footers on each page provide contact information and a longer description of the newsletter.", "url": "vlsut"}, {"name": "Frequently Asked Questions", "cat": "Miscellaneous", "desc": "This template provides an easy framework for creating a frequently asked questions (FAQ's) document. The first page features a large title followed by a subtitle and list of all questions. Questions are clearly displayed in colored boxes with answers after them in plain text. Each question can contain a unique label to allow referencing it in future questions via links. Questions are also automatically numbered and this number can be referred to at any point.", "url": "ewjmx"}, {"name": "Fancyslides Presentation", "cat": "Presentations", "desc": "This presentation template uses the Fancyslides class which builds on top of the well-known beamer class to give it a modern and concise design. The template is very minimalist with large font sizes and little space for text and would thus be suited for popular presentations by confident speakers. It makes extensive use of background images for slides to provide a strong visual counterpart to the verbal presentation. Content within the presentation is housed within translucent colored circles or rectangles. The former are used for main points or section delineations while the latter are used for larger blocks of text or data slides. Several predefined color options are present within the template and you can also define your own.", "url": "nucat"}, {"name": "a0poster Portrait Poster", "cat": "Conference Posters", "desc": "This poster features a clean portrait layout with a large header section housing important information about the poster and space for a logo of your institution or a photo of you. Poster content is neatly divided into two columns which is typical for a poster with a portrait orientation. The number of columns can easily be changed if you would like more room for text. The template features the ability to easily change the color of any section or element and shows this off with several examples (e.g. the color of the introduction and conclusions sections).", "url": "gwkfh"}, {"name": "a0poster Landscape Poster", "cat": "Conference Posters", "desc": "This poster features a clean landscape layout with a large header section housing important information about the poster, a column for contact information and space for a logo of your institution or a photo of you. Poster content is neatly divided into four columns to make use of the space available as much as possible. The number of columns can easily be changed if you would like the extra width for larger tables and figures. The template features the ability to easily change the color of any section or element and shows this off with several examples (e.g. the color of the introduction and conclusions sections).", "url": "huomw"}, {"name": "baposter Landscape Poster", "cat": "Conference Posters", "desc": "This poster template features a large header with space for two logos to either side of the title and neatly divides poster content into separate boxes with clear headings in each one. The landscape layout features four columns which can be merged into larger blocks if required, such as in the Results 1, Conclusion and Future Research sections of the template. Merged blocks allow more space for showing off results while blocks taking up one column are ideal for small paragraphs of text or details about the research.", "url": "vsnbm"}, {"name": "Elsevier’s elsarticle Document Class", "cat": "Academic Journals", "desc": "Elsevier's elsarticle document class and templates can be used by academics to write and submit journal articles to all Elsevier journals. There are presently over 2,700 journals published by Elsevier with over 250,000 articles published per year. Popular journals include Cell, The Lancet, Lancet Infectious Diseases and Lancet Neurology but a complete list of all Elsevier journals can be found here. Elsevier explicitly state that this class and templates are their preferred format for articles submitted to all of their journals.", "url": "wsnyv"}, {"name": "American Geophysical Union", "cat": "Academic Journals", "desc": "The American Geophysical Union AGU allows authors to submit their manuscript formatted in LaTeX to any of their journals. For this, they provide a template which contains the structure and reference style they would like for submissions. The template contains two tex files, one for the article and another for supporting information.", "url": "wbfoc"}, {"name": "Press Release", "cat": "Miscellaneous", "desc": "This template makes writing a press release easy by dividing the document into the necessary sections and elements that are required for a clear press release. At the top of the press release is a place for a logo for your company/institution which serves to give the release credibility and recognition. Underneath this is a section for contact information regarding the release along with the date of the release. Next is the headline and subtitle which need to grab the attention and provide enough detail to make the purpose of the release clear at a glance. Finally, the content of the press release starts with a location, date and summary of the content followed by the body of the release.", "url": "iwfoq"}, {"name": "Long Lined Cover Letter", "cat": "Cover Letters", "desc": "This cover letter template features a clean professional layout which can take a large amount of text per page. The ability to include a company/institution logo at the top of the letter further adds to the professional look. The content of the letter itself is presented between two horizontal lines and contains your contact information, the addressee and letter content. Any element of the letter can be easily removed within the template to customize the layout to your requirements.", "url": "prtya"}, {"name": "PNAS Journal", "cat": "Academic Journals", "desc": "The Proceedings of the National Academy of Sciences of the United States of America PNAS allows authors to submit their manuscript formatted in LaTeX to the PNAS Journal. For this, they provide a template which contains the structure and reference style they would like for submissions. The PNAS LaTeX template features a two-column layout and mirrors the layout seen in final publications released by PNAS.", "url": "bpkjo"}, {"name": "baposter Portrait Poster", "cat": "Conference Posters", "desc": "This poster template neatly divides content into separate boxes with clear headings in each one. The portrait layout features a small side column for study details and a larger column to show off results obtained from the research. The larger column can be optionally divided into two columns to squeeze more information into the poster. The default colors of the template are in the blue spectrum but can be easily changed within the template. Examples of a table, figure, equation, list and bibliography are present in the template to provide a starting point for any requirement you may have for your own poster.", "url": "bzzng"}, {"name": "Dreuw & Deselaer’s Poster", "cat": "Conference Posters", "desc": "This poster template features a dark gray color scheme for content and a contrasting title and footer to highlight important information about the research. Content is laid out in two columns in a portrait orientation but changing it to landscape and increasing the number of columns is quite easy. The template makes extensive use of lists for styling which promotes a clear and concise description of research. Examples of a table, figure, equation, list and bibliography are present in the template to provide a starting point for any requirement you may have for your own poster.", "url": "amvnk"}, {"name": "Royal Society of Chemistry", "cat": "Academic Journals", "desc": "The Royal Society of Chemistry provides two LaTeX templates for authors to submit articles and communications to all journals they publish. Each template includes dummy content which provides an example for authors for how to write their paper in LaTeX. At the submission stage, authors are requested to provide a PDF of the manuscript typeset in LaTeX including all figures as well as the LaTeX files. Supplementary information should be provided as separate PDFs. For more information please see the Article templates page at the RSC website.", "url": "agawy"}, {"name": "Jacobs Landscape Poster", "cat": "Conference Posters", "desc": "This poster template features a clean sectioned look suitable for presenting research at a conference. Important information is highlighted with colored boxes and each section within the poster is clearly separated from the others. The layout of the template contains four columns but this can be changed to accommodate varying amounts of information or figures. Examples of a table, figure, equation, list and bibliography are present in the template to provide a starting point for any requirement you may have for your own poster.", "url": "avqtd"}, {"name": "KOMA-Script Presentation", "cat": "Presentations", "desc": "This presentation template is unique in that it uses the standard KOMA-Script scrartcl class to create a beautiful presentation. The use of a standard class means that this template allows direct copy/pasting from other LaTeX documents and doesn't require specialized commands like other presentation classes. The design of the slides is focused on readability with large fonts and line spacing. Each slide features a running head and a footer with information about the author as well as progress through the presentation. The coloring, shadows and custom fonts give the presentation an elegant look while clearly displaying any type of content.", "url": "jiwfd"}, {"name": "Classicthesis-Styled CV", "cat": "Curricula Vitae/Résumés", "desc": "This template combines the Classicthesis style with the currvita document layout to create a beautiful CV/Résumé. The margin is moved to the left of the document and now holds employer names, degrees or descriptions which makes for quick reference by potential employers. Major headings are clearly separated as blocks within which each entry is styled with the date, title and description. The template is quite compact and manages to squeeze references and grades for courses into small blocks of text.", "url": "pmuca"}, {"name": "Code Snippet", "cat": "Miscellaneous", "desc": "Often times it is useful to include some code in a document, either as an example or to display it for publication. This template simplifies the process of including code from virtually any programming language in a LaTeX document. It uses the listings package to create a box around a piece of code and allows a large number of well-commented customizations to change its appearance.", "url": "iozzd"}, {"name": "Stylish Article", "cat": "Articles", "desc": "This article template attempts to emulate the design of contemporary scientific publications. It does this by including colored boxes behind the abstract and headings and a succinct text layout. The template features a table of contents, something usually not seen in articles, which makes it ideal for longer articles with significant structure or for archival purposes.", "url": "ieuqu"}, {"name": "Engineering Calculation Paper", "cat": "Miscellaneous", "desc": "This template for engineering calculation paper is designed for engineers to present calculations in a clear way for review or documentation purposes. The large header includes meta-information about the document for easy tracking and includes space for a company or university logo.", "url": "uldei"}, {"name": "Tufte-Style Book", "cat": "Books", "desc": "This book template has been designed to conform to Edward R. Tufte's design style, used in his books and handouts. The most defining feature of this design is the large margin on every page and extensive use of sidenotes. This layout means that the central column of text is uncluttered since further descriptions and citations are housed in the margin. Tufte's design style does not end there and numerous other typographic and layout tweaks are present in this template and are described in the documentation template.", "url": "abbgv"}, {"name": "ModernCV and Cover Letter", "cat": "Curricula Vitae/Résumés", "desc": "This template uses the 'ModernCV' class to create a multi-page CV and cover letter. The CV is clearly structured with large section titles and important dates on a sidebar. Contact information is clearly displayed in a gray block. This class features four document themes which completely change the layout of the document, to get a preview of each of these themes see the PDF previews below. Changing themes is as simple as changing one word.", "url": "irkls"}, {"name": "Beamer Presentation", "cat": "Presentations", "desc": "This presentation template uses the well-known Beamer class and shows how effortless presentation-making with LaTeX can be. The template has examples of most of the features that are typically found in a presentation, including the following example slides: title, overview, paragraphs of text, bullet points, blocks of highlighted text, multiple columns, tables, theorems, verbatim text, figures, citations, references and conclusions/acknowledgments.", "url": "bxwtu"}, {"name": "Invoice", "cat": "Miscellaneous", "desc": "This invoice template allows a small business or individual to produce invoices for goods and services. It features a clear header including the company providing the invoice followed by the recipient's information. The list of goods and services being charged for is clear and concise separated by individual days and categories. The ability to include one-off expenses (without an hourly rate) is also present. The template is very simple to fill out; for each line a date, the number of hours worked and the hourly rate are specified and the template does all the calculations to produce the subtotal and total.", "url": "pwuou"}, {"name": "Chemical Equations", "cat": "Miscellaneous", "desc": "This template provides a quick reference for typesetting chemical equations in LaTeX using the mhchem package which has been specifically designed to make chemical typesetting intuitive. The template starts with simple chemical notation and progresses to complex chemical equations involving a variety of interactions and notations.", "url": "nlrfg"}, {"name": "Journal Article", "cat": "Articles", "desc": "This article template aims to emulate scientific journal publications by using a conservative thin document style. The format of the template follows the typical journal publication including an abstract for summarizing the article, introduction, methods, results and discussion. Examples of an equation, table and list are included.", "url": "msjae"}, {"name": "Compact Laboratory Book", "cat": "Laboratory Books", "desc": "This template is useful for keeping track of progress made on different experiments in a laboratory. It features a compact layout for clean reading with each day clearly distinct from other days. Multiple experiments and sub-experiments can be cited for each day allowing the tracking of progress on multiple different avenues of research more easily. The template includes examples of a table, figure, equation, bibliography and citation. Hyperlinks to citations, figures and pages means the lab book is easy to navigate for later information retrieval during writing up.", "url": "lwcky"}, {"name": "Classicthesis Typographic Thesis", "cat": "Theses", "desc": "This template has been designed as a homage to the elements of typographic style. As such, it has an air of efficiency and optimal design. It is suitable for any high-level degree thesis such as for a PhD, Masters or Honors. Sections within the thesis are clearly separated in a consistent way, as are sections within each chapter. The default structure of the thesis proceeds in the following order: title page, dedication, abstract, publications, acknowledgements, contents, list of tables/figures/listings, acronyms, content chapters, appendices, bibliography, colophon and declaration.", "url": "tbbif"}, {"name": "Medium Length Professional", "cat": "Curricula Vitae/Résumés", "desc": "This curriculum vitae template is clearly structured into sections separated by lines. As is, the template is more conducive to medium-length professional CV's where work experience dominates the interest of the employer. The template can easily be expanded out to multiple pages but is best kept to at most 2 pages for section clarity.", "url": "esjlm"}, {"name": "University/School Laboratory Report", "cat": "Laboratory Reports", "desc": "This template provides a clean structured format for writing a report based on a laboratory experiment. The structure follows the typical flow of information required in a laboratory report: the objective of the experiment, methods, data gathered, results and discussion. This template would best suit an student's write-up of an experiment at a university or school.", "url": "rejdp"}, {"name": "Daily Laboratory Book", "cat": "Laboratory Books", "desc": "This template is useful for those working in a laboratory where records must be kept for academic or commercial purposes. Often times working in the laboratory means scrawling messy notes in a physical book so this template helps to make a laboratory book more organized and digitally searchable. The template features a cover page, hyperlinked table of contents, daily logs of progress made on individual experiments and a formulae and media recipes section. The template is organized in such a way that each day is simple to add to the book.", "url": "xhbjf"}, {"name": "Medium Length Graduate CV", "cat": "Curricula Vitae/Résumés", "desc": "This curriculum vitae template has section headings on the left side of the document with section content on the right. Bullet points are used to separate different tasks within each job. This document layout makes this template more suited to a short or medium length curriculum vitae taking at most two pages. Would be best used by a recent graduate with limited experience looking for their first job.", "url": "kjndd"}, {"name": "Long Professional CV", "cat": "Curricula Vitae/Résumés", "desc": "This curriculum vitae template is clearly structured with bold centered category names for each section. The descriptions of tasks for each job are in bullet points. This template is conducive to longer CVs since there is no aesthetic limit to how much information can be placed in each section. Would suit a professional in the mid- to late-stage of their career.", "url": "rppkz"}, {"name": "Plain Cover Letter", "cat": "Cover Letters", "desc": "A plain cover letter template with your name and address at the top in bold. The layout is traditional and is best suited to single-page letters. The format offers plenty of space for a longer cover letter and includes a description of the content that should be written in each paragraph.", "url": "zkdpd"}]